app/views/matchs/show.html.erb

SELECT "matches".* FROM "matches" WHERE "matches"."day_id" = $1  [["day_id", 6]]
---
  <div>
    <% @day.matchs.each do |match| %>