app/controllers/matchs_controller.rb

  def new
    @date = params[:date]
    url = "http://www.allomatch.com/fr/match/listTv?team=Tapez%20une%20%C3%A9quipe%20ou%20un%20tournoi%20ici&channels=&match-search-from=#{@date.split('-')[2]}%2F#{@date.split('-')[1]}%2F#{@date.split('-')[0]}&match-search-to=#{@date.split('-')[2]}%2F#{@date.split('-')[1]}%2F#{@date.split('-')[0]}&sport_id=&important_dates=#{@date}"
    html_content = open(url).read
    doc = Nokogiri::HTML(html_content)

    game = []
    doc.xpath('//span[@class="summary"]').each do |element|
      game << element.text
    end

    hour = []
    doc.xpath('//div[@class="dtstart match-tv-time"]').each do |element|
      hour << element.text.strip
    end

    channel = []
    doc.xpath('//div[@class="list-match-channels"]').each do |element|
      channel << element.text.strip
    end
    channels = channel.map do |element|
      element.gsub(/(\n\s*)+/,',')
    end

    final = channels.map do |element|
      element.split(',')
    end

    if Day.exists?(name: params[:date])
      Day.find_by(name: params[:date]).destroy
      @day = Day.new(name: @date)
    end
    @day = Day.new(name: @date)
    @day.save

    for i in 0..game.size - 1 do
      @match = Match.new(name: game[i], hour: hour[i], channel: final[i].join(' / '), day_id: @day.id)
      @match.save
    end
    @day = Day.find_by(name: params[:date])
---
SELECT  "days".* FROM "days" ORDER BY "days"."id" DESC LIMIT $1  [["LIMIT", 1]]
SELECT  1 AS one FROM "days" WHERE "days"."name" = $1 LIMIT $2  [["name", "2019-02-25"], ["LIMIT", 1]]
DELETE FROM "days" WHERE "days"."id" = $1  [["id", 2]]
SELECT  "days".* FROM "days" WHERE "days"."name" = $1 LIMIT $2  [["name", "2019-02-20"], ["LIMIT", 1]]
INSERT INTO "days" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "2019-02-20"], ["created_at", "2019-02-16 16:32:48.524705"], ["updated_at", "2019-02-16 16:32:48.524705"]]
SELECT "matches".* FROM "matches"
INSERT INTO "matches" ("name", "day_id", "hour", "channel", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Dubaï - Simple"], ["day_id", 2], ["hour", "08:00"], ["channel", "BeIN SPORTS 3"], ["created_at", "2019-02-16 16:32:48.544780"], ["updated_at", "2019-02-16 16:32:48.544780"]]
SELECT  "days".* FROM "days" WHERE "days"."name" = $1 LIMIT $2  [["name", "2019-02-25"], ["LIMIT", 1]]

  def show
    @date = params[:date]
    @day = Day.find_by(name: @date)
---
SELECT  "days".* FROM "days" WHERE "days"."name" = $1 LIMIT $2  [["name", "2019-02-20"], ["LIMIT", 1]]

  def delete
    @match = Match.find_by(id: params[:id])
    @day = Day.find_by(id: @match.day_id)
    @match.destroy
---
SELECT  "matches".* FROM "matches" WHERE "matches"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
SELECT  "days".* FROM "days" WHERE "days"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "matches".* FROM "matches" WHERE "matches"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "matches" WHERE "matches"."id" = $1  [["id", 13]]